Revit 2027 API
TemporaryGraphicsManager.UpdateControl Method
 Updates the in-canvas control identified by the unique index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UpdateControl(
	int index,
	InCanvasControlData data
)
Public Sub UpdateControl (
	index As Integer,
	data As InCanvasControlData
)
public:
void UpdateControl(
	int index,
	InCanvasControlData^ data
)
member UpdateControl :
        index : int *
        data : InCanvasControlData -> unit
Parameters
index Int32
 Unique index of the control to be updated.
data InCanvasControlData
 data to generate in-canvas control appearance.
Exceptions
Exception | Condition
ArgumentException |  index is out of range of TemporaryGraphicsManager managed objects, or the indexed object has been removed from the document.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to load the image from specified path.
See Also
Reference
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace